Tests/joachim/ChargeAmountReq_unpatched.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ZSI="http://www.zolera.com/schemas/ZSI/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ns1:Security xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="binaryToken" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">MIIDgDCCAmigAwIBAAIERkhBpjANBgkqhkiG9w0BAQQFADCBgTEdMBsGCSqGSIb3DQEJARYOaW5m
b0BhenVyaXguY2gxCzAJBgNVBAYTAmNoMQ0wCwYDVQQIEwRiZXJuMQ0wCwYDVQQHEwRiZXJuMQ8w
DQYDVQQKEwZhenVyaXgxDTALBgNVBAsTBHRlc3QxFTATBgNVBAMTDHRlc3RQYXJ0bmVyMjAeFw0w
NzA1MTQxMTAxNThaFw0xMjA1MTQxMTAxNThaMIGBMR0wGwYJKoZIhvcNAQkBFg5pbmZvQGF6dXJp
eC5jaDELMAkGA1UEBhMCY2gxDTALBgNVBAgTBGJlcm4xDTALBgNVBAcTBGJlcm4xDzANBgNVBAoT
BmF6dXJpeDENMAsGA1UECxMEdGVzdDEVMBMGA1UEAxMMdGVzdFBhcnRuZXIyMIIBIjANBgkqhkiG
9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvfUj3BH/BS8GQv7btxvrxBY1p2hNG5vWPperVPqiyClbLtsQ
5ylpo3Ap5krxQqNqxBLfDlAMJAS5PDzyBs2/XX4qGapnNdQ6QpRg8tPnvh550xxoWA2Zkp7W9wuj
jHhCxnP7uyGkiExMfgVCMO9OGnsKIqjbffqTBPdji+bFvRiW/MHRxZs8UHJj/HWM78KoSg+gax5S
5orWRflgOKESm92ga3FA9wAtU8773pmEIXLYPjwpr6nTbX6lGN1bO0/Z/31+/TthFpaiYR7wYgqh
cNvs938zFOTB/63rgnxPmzaW8XCV1ucekKMDI4KLUA4DyaQaKo7HAtofGQDS9CXdgwIDAQABMA0G
CSqGSIb3DQEBBAUAA4IBAQBl7uisA1p7c91VxhfZO91Uk5kG+fEG0+vLTHeXzpg+m7AhIO7joxqL
zU1CB0/ZlaBlKOR1qkbucJlJWJc4tNeWCKvAt8+ptFavDw2gPXAJ8iCfDqoPS5IoIeiAF+d5AQk5
jnN5VIgLU18WhOU6RYSDtm6g0xng4t8044a7XdQtTj3EYkypcVx1h0/JHsDuLXXJzL8GUcP+FYJ4
rWjSqDUVepRJSukNnOfUzDbUHXy45HjFQ/AuPeeytPFvAoRqKisDPTn4mqmd6MjhQTp4e+JkCWws
vP8wJA2xw+rGKPq52Yw91d6hCRxRNEcnitHlM8Sk9OFvUn54zFSBDGzsuLlA
</wsse:BinarySecurityToken><ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces></ec:InclusiveNamespaces></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#binaryToken"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces></ec:InclusiveNamespaces></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>vu5qLbr0679UmpSQp1E/ZGeWFFU=</ds:DigestValue></ds:Reference><ds:Reference URI="#body"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces></ec:InclusiveNamespaces></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>skDZE9T4G66JitenG3ix7ByShrQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>FG3KvPGNwsMtJRTuweijmUTaNCsgCjuYscb5MmTbauu+tH0v30PpVj03bq5CDw2dF4uaoxf8K5qi
zcHh9rSNJZ9jEUKAY07dzZuoEkzBsKfKo8filrP2Yh1Z0Buz76lxyY45L6hOPcXbUD4jFO6Q5JzN
UeCB2HhsCeWrrvw0umxtpS5RMKxmqBCw6Rb3aAOlmWhT1G+7eF06fpsY4QtrWFP4fnw85gEOsMtU
1AGzrz2WbbzlffOGqrv1mhPmLvgx0Aznv8Wf0LNjEgliDgihTJBQs+KZajfdEXm4UFQ5jy03CL3K
PC0FoD2GCB/okVUn0LARffdESHVFUWrn2WItOg==</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#binaryToken"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></ns1:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:ns1="http://www.csapi.org/schema/parlayx/payment/amount_charging/v3_1/local" wsu:Id="body" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ns1:chargeAmount xsi:type="ns1:chargeAmount"><ns1:endUserIdentifier>tel:-;imsi=228014020029735</ns1:endUserIdentifier><ns1:charge><description>TPE billing</description><code>urn:scs:vfl:dvbhNokiaBam:WAP:ALL::10836:1:Month:Recurrent:NonRoaming</code></ns1:charge><ns1:referenceCode>urn:scs:vfl:dvbhNokiaBam:WAP:ALL::10836:1:Month:Recurrent:NonRoaming</ns1:referenceCode></ns1:chargeAmount></SOAP-ENV:Body></SOAP-ENV:Envelope>